const express = require('express');
const authController = require('../controllers/authController');

const router = express.Router();


/**************************************회원가입 페이지************************************/
router.get('/register', authController.renderRegisterPage); // 회원가입 페이지 렌더링
/****************************************************************************************/

/**************************************로그인 라우트*************************************/
router.get('/login', authController.renderLoginPage); // 로그인 페이지 렌더링
/****************************************************************************************/

/**************************************로그아웃 라우트************************************/
router.get('/logout', authController.logoutUser); // 로그아웃 페이지 렌더링 (UI에서는 GET으로도 처리 가능)
/****************************************************************************************/

module.exports = router;